toasterllc/MDCCode/Code/STM32/STApp/Source/main.cpp
    // Take ICE40 out of reset
    _ICE_CRST_::Write(1);
    
    // Send status
    _System::USBSendStatus(true);
}

static void _ICEFlashWrite(const STM::Cmd& cmd) {
    auto& arg = cmd.arg.ICEFlashWrite;
    
    // Accept command
    _System::USBAcceptCommand(true);
    
    // Configure ICE40 control GPIOs
    _ICE_CRST_::Config(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
    _ICE_CDONE::Config(GPIO_MODE_INPUT, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
    _ICE_ST_SPI_CLK::Config(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
    _ICE_ST_SPI_CS_::Config(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
    _ICE_ST_FLASH_EN::Config(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
    _ICE_ST_SPI_D4::Config(GPIO_MODE_INPUT, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
    _ICE_ST_SPI_D5::Config(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
    
    // Hold ICE40 in reset while we write to flash
    _ICE_CRST_::Write(0);
    
    // Set default clock state before enabling flash
    _ICE_ST_SPI_CLK::Write(0);
    
    // De-assert chip select before enabling flash
    _ICE_ST_SPI_CS_::Write(1);
    
    // Enable flash
    _ICE_ST_FLASH_EN::Write(1);
    
    // Reset flash
    _ICEFlashOut(0x66);
    _ICEFlashOut(0x99);
    _Scheduler::Sleep(_Scheduler::Us(32)); // "the device will take approximately tRST=30us to reset"
    
    // Write enable
    _ICEFlashOut(0x06);
    // Mass erase
    _ICEFlashOut(0xC7);
    // Wait until erase is complete
    _ICEFlashWait();
    
    // Reset state
    _Bufs.reset();
    
    // Trigger the USB DataOut task with the amount of data
    _TaskUSBDataOut::Start(arg.len);
    
    constexpr size_t FlashPageSize = 256;
    uint32_t addr = 0;
    for (;;) {
        // Wait until we have data to consume, and QSPI is ready to write
        _Scheduler::Wait([] { return _Bufs.rok(); });
        
        // Write the data over SPI and wait for completion
        auto& buf = _Bufs.rget();
        if (buf.len) {
            // We only allow writing to addresses that are page-aligned.
            // If we receive some data over USB that isn't a multiple of the flash's page size,
            // then this check will fail. So data sent over USB must be a multiple of the flash
            // page size, excepting the final/remainder piece of data if the entire data isn't
            // a multiple of the flash's page size.
            if (addr & (FlashPageSize-1)) {
                _System::USBSendStatus(false);
                return;
            }
            
            size_t chunkOff = 0;
            for (;;) {
                const size_t chunkLen = std::min(FlashPageSize, buf.len-chunkOff);
                if (!chunkLen) break;
                
                // Write enable
                _ICEFlashOut(0x06);
                
                // Page program
                {
                    const uint8_t instr[] = {
                        0x02,
                        (uint8_t)((addr&0xFF0000)>>16),
                        (uint8_t)((addr&0x00FF00)>>8),
                        (uint8_t)((addr&0x0000FF)>>0),
                    };
                    
                    _ICE_ST_SPI_CS_::Write(0);
                    __ICEFlashOut(instr, sizeof(instr));
                    __ICEFlashOut(buf.data+chunkOff, chunkLen);
                    _ICE_ST_SPI_CS_::Write(1);
                }
                
                // Wait until write is complete
                _ICEFlashWait();
                
                chunkOff += chunkLen;
                addr += chunkLen;
            }
        }
        
        _Bufs.rpop();
        if (!buf.len) break; // We're done when we receive an empty buffer
    }
    
    // Disable flash
    _ICE_ST_FLASH_EN::Write(0);
    
    _ICE_ST_SPI_CLK::Config(GPIO_MODE_INPUT, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
    _ICE_ST_SPI_CS_::Config(GPIO_MODE_INPUT, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
    _ICE_ST_FLASH_EN::Config(GPIO_MODE_INPUT, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
    _ICE_ST_SPI_D4::Config(GPIO_MODE_INPUT, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
    _ICE_ST_SPI_D5::Config(GPIO_MODE_INPUT, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
    
    // Take ICE40 out of reset
    _ICE_CRST_::Write(1);
    
    // Send status
    _System::USBSendStatus(true);
}

static void _MSPHostModeSet(const STM::Cmd& cmd) {
    auto& arg = cmd.arg.MSPHostModeSet;
    
    // Accept command
    _System::USBAcceptCommand(true);
    
    const MSP::Cmd mspCmd = {
        .op = MSP::Cmd::Op::HostModeSet,
        .arg = { .HostModeSet = { .en = arg.en } },
    };
    MSP::Resp mspResp;
    
    const bool ok = _I2C::Send(mspCmd, mspResp);
    if (!ok || !mspResp.ok) {
        _System::USBSendStatus(false);
        return;
    }
    
    // Send status
    _System::USBSendStatus(true);
}

static bool __MSPStateRead(uint8_t* data, size_t len) {
    using ChunkIdx = decltype(MSP::Cmd::arg.StateRead.chunk);
    constexpr size_t ChunkSize = sizeof(MSP::Resp::arg.StateRead.data);
    
    // Make sure `chunkCount-1` won't overflow our struct field
    const size_t chunkCount = (len+ChunkSize-1) / ChunkSize;
    if (chunkCount-1 > std::numeric_limits<ChunkIdx>::max())
        return false;
    
    for (size_t off=0, chunk=0; chunk<chunkCount; chunk++) {
        const MSP::Cmd mspCmd = {
            .op = MSP::Cmd::Op::StateRead,
            .arg = { .StateRead = { .chunk = (ChunkIdx)chunk } },
        };
        
        MSP::Resp mspResp;
        const bool ok = _I2C::Send(mspCmd, mspResp);
        if (!ok) return false;
        
        const size_t l = std::min(len, ChunkSize);
        memcpy(data+off, mspResp.arg.StateRead.data, l);
        off += l;
        len -= l;
    }
    
    return true;
}

//static size_t __MSPStateRead(uint8_t* data, size_t cap) {
//    MSP::State::Header header;
//    if (cap < sizeof(header)) return 0;
//    
//    size_t off = 0;
//    bool ok = __MSPStateRead(off, (uint8_t*)&header, sizeof(header));
//    if (!ok) return 0;
//    
//    // Copy header into destination buffer
//    memcpy(data+off, (uint8_t*)&header, sizeof(header));
//    off += sizeof(header);
//    
//    // Validate that the caller has enough space to hold the header + payload
//    if (cap < sizeof(header) + header.length) return 0;
//    // Read payload directly into destination buffer
//    ok = __MSPStateRead(off, data+off, header.length);
//    if (!ok) return 0;
//    off += header.length;
//    return off;
//}

static void _MSPStateRead(const STM::Cmd& cmd) {
    // Reset state
    _Bufs.reset();
    auto& buf = _Bufs.wget();
    
    auto& arg = cmd.arg.MSPStateRead;
    if (arg.len > sizeof(buf.data)) {
        // Reject command if the requested amount of data doesn't fit in our buffer
        _System::USBAcceptCommand(false);
        return;
    }
    
    // Accept command
    _System::USBAcceptCommand(true);
    
    bool ok = __MSPStateRead(buf.data, arg.len);
    if (!ok) {
        _System::USBSendStatus(false);
        return;
    }
    
