toasterllc/MDCCode/Code/STM32/STApp/Source/main.cpp
    // Send status
    _System::USBSendStatus(true);
    
    // Send data
    _USB::send(Endpoints::DataIn, buf.data, arg.len);
}

static void _MSPStateWrite(const STM::Cmd& cmd) {
    // Accept command
    _System::USBAcceptCommand(true);
    
    // TODO: implement? not sure we actually need this though...
    
    // Send status
    _System::USBSendStatus(false);
}

static void _MSPTimeSet(const STM::Cmd& cmd) {
    auto& arg = cmd.arg.MSPTimeSet;
    
    // Accept command
    _System::USBAcceptCommand(true);
    
    const MSP::Cmd mspCmd = {
        .op = MSP::Cmd::Op::TimeSet,
        .arg = { .TimeSet = { .time = arg.time } },
    };
    
    MSP::Resp mspResp;
    const bool ok = _I2C::Send(mspCmd, mspResp);
    if (!ok || !mspResp.ok) {
        _System::USBSendStatus(false);
        return;
    }
    
    // Send status
    _System::USBSendStatus(true);
}

static void _MSPSBWConnect(const STM::Cmd& cmd) {
    // Accept command
    _System::USBAcceptCommand(true);
    
    const auto mspr = _MSP.connect();
    
    // Send status
    _System::USBSendStatus(mspr == _MSP.Status::OK);
}

static void _MSPSBWDisconnect(const STM::Cmd& cmd) {
    // Accept command
    _System::USBAcceptCommand(true);
    
    _MSP.disconnect();
    
    // Send status
    _System::USBSendStatus(true);
}

static void _MSPSBWRead(const STM::Cmd& cmd) {
    auto& arg = cmd.arg.MSPSBWRead;
    
    // Accept command
    _System::USBAcceptCommand(true);
    
    // Reset state
    _Bufs.reset();
    
    // Start the USB DataIn task
    _TaskUSBDataIn::Start();
    
    uint32_t addr = arg.addr;
    uint32_t len = arg.len;
    while (len) {
        _Scheduler::Wait([] { return _Bufs.wok(); });
        
        auto& buf = _Bufs.wget();
        // Prepare to receive either `len` bytes or the
        // buffer capacity bytes, whichever is smaller.
        const size_t chunkLen = std::min((size_t)len, sizeof(buf.data));
        _MSP.read(addr, buf.data, chunkLen);
        addr += chunkLen;
        len -= chunkLen;
        // Enqueue the buffer
        buf.len = chunkLen;
        _Bufs.wpush();
    }
    
    // Wait for DataIn task to complete
    _Scheduler::Wait([] { return !_Bufs.rok(); });
    // Send status
    _System::USBSendStatus(true);
}

static void _MSPSBWWrite(const STM::Cmd& cmd) {
    auto& arg = cmd.arg.MSPSBWWrite;
    
    // Accept command
    _System::USBAcceptCommand(true);
    
    // Reset state
    _Bufs.reset();
    
    // Trigger the USB DataOut task with the amount of data
    _TaskUSBDataOut::Start(arg.len);
    
    uint32_t addr = arg.addr;
    for (;;) {
        _Scheduler::Wait([] { return _Bufs.rok(); });
        
        // Write the data over Spy-bi-wire
        auto& buf = _Bufs.rget();
        if (buf.len) {
            _MSP.write(addr, buf.data, buf.len);
            addr += buf.len; // Update the MSP430 address to write to
        }
        _Bufs.rpop();
        if (!buf.len) break; // We're done when we receive an empty buffer
    }
    
    _System::USBSendStatus(true);
}

struct _MSPSBWDebugState {
    uint8_t bits = 0;
    uint8_t bitsLen = 0;
    size_t len = 0;
    bool ok = true;
};

static void _MSPSBWDebugPushReadBits(_MSPSBWDebugState& state, _BufQueue::Buf& buf) {
    if (state.len >= sizeof(buf.data)) {
        state.ok = false;
        return;
    }
    
    // Enqueue the new byte into `buf`
    buf.data[state.len] = state.bits;
    state.len++;
    // Reset our bits
    state.bits = 0;
    state.bitsLen = 0;
}

static void _MSPSBWDebugHandleSBWIO(const MSPSBWDebugCmd& cmd, _MSPSBWDebugState& state, _BufQueue::Buf& buf) {
    const bool tdo = _MSP.debugSBWIO(cmd.tmsGet(), cmd.tclkGet(), cmd.tdiGet());
    if (cmd.tdoReadGet()) {
        // Enqueue a new bit
        state.bits <<= 1;
        state.bits |= tdo;
        state.bitsLen++;
        
        // Enqueue the byte if it's filled
        if (state.bitsLen == 8) {
            _MSPSBWDebugPushReadBits(state, buf);
        }
    }
}

static void _MSPSBWDebugHandleCmd(const MSPSBWDebugCmd& cmd, _MSPSBWDebugState& state, _BufQueue::Buf& buf) {
    switch (cmd.opGet()) {
    case MSPSBWDebugCmd::Ops::TestSet:     _MSP.debugTestSet(cmd.pinValGet());     break;
    case MSPSBWDebugCmd::Ops::RstSet:      _MSP.debugRstSet(cmd.pinValGet()); 	    break;
    case MSPSBWDebugCmd::Ops::TestPulse:   _MSP.debugTestPulse(); 				    break;
    case MSPSBWDebugCmd::Ops::SBWIO:       _MSPSBWDebugHandleSBWIO(cmd, state, buf);	break;
    default:                            abort();
    }
}

static void _MSPSBWDebug(const STM::Cmd& cmd) {
    auto& arg = cmd.arg.MSPSBWDebug;
    
    // Bail if more data was requested than the size of our buffer
    if (arg.respLen > sizeof(_BufQueue::Buf::data)) {
        // Reject command
        _System::USBAcceptCommand(false);
        return;
    }
    
    // Accept command
    _System::USBAcceptCommand(true);
    
    // Reset state
    _Bufs.reset();
    auto& bufIn = _Bufs.wget();
    _Bufs.wpush();
    auto& bufOut = _Bufs.wget();
    
    _MSPSBWDebugState state;
    
    // Handle debug commands
    {
        size_t cmdsLenRem = arg.cmdsLen;
        while (cmdsLenRem) {
            // Receive debug commands into buf
            const size_t recvLen = _USB::Recv(Endpoints::DataOut, bufIn.data, sizeof(bufIn.data));
            const size_t cmdsLen = recvLen / sizeof(MSPSBWDebugCmd);
            
            // Handle each MSPSBWDebugCmd
            const MSPSBWDebugCmd* cmds = (MSPSBWDebugCmd*)bufIn.data;
            for (size_t i=0; i<cmdsLen && state.ok; i++) {
                _MSPSBWDebugHandleCmd(cmds[i], state, bufOut);
            }
            
            cmdsLenRem -= cmdsLen;
        }
    }
    
    // Reply with data generated from debug commands
    {
        // Push outstanding bits into the buffer
        // This is necessary for when the client reads a number of bits
        // that didn't fall on a byte boundary.
        if (state.bitsLen) _MSPSBWDebugPushReadBits(state, bufOut);
        
        if (arg.respLen) {
            // Send the data and wait for it to be received
            _USB::Send(Endpoints::DataIn, bufOut.data, arg.respLen);
        }
    }
    
